# Homebrew bundle: GUI applications, local casks, and App Store apps.
#
# This file is the source of truth. Apply it with `task brew` and capture
# drift with `task import:brew` (VS Code extensions are intentionally
# excluded via --no-vscode). Homebrew is intentionally NOT on $PATH --
# `task` is the only entry point. CLI binaries come from mise, and base
# packages plus pinned runtimes come from Nix.

# --- Taps -------------------------------------------------------------------
tap "civitaspo/dotfiles", __dir__
tap "nikitabobko/tap"

# --- Casks: applications ----------------------------------------------------
cask "1password"
cask "nikitabobko/tap/aerospace"
cask "aqua-voice"
cask "arc"
cask "azookey"
cask "chatgpt"
cask "claude"
cask "civitaspo/dotfiles/circleback"
cask "cleanshot"
cask "codex-app"
cask "cursor"
cask "ghostty"
cask "google-japanese-ime"
cask "hammerspoon"
cask "homerow"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "linear"
cask "mimestream"
cask "civitaspo/dotfiles/openin4"
cask "qmk-toolbox"
cask "raycast"
cask "spotify"
cask "tabtab"

# --- Casks: fonts -----------------------------------------------------------
cask "font-monaspice-nerd-font"

# --- Mac App Store ----------------------------------------------------------
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Display Menu", id: 549083868
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Klack", id: 6446206067
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Twingate", id: 1501592214
